/*
Ложкин Сергей, ПС-21
Среда: CLion, C++

25. На диске имеется база  данных  по  физическим  эффектам
(ФЭ).  Каждый  ФЭ  записан в виде тройки компонент:  название,
входная  физическая  величина  (вход),   выходная   физическая
величина  (выход).  Имеется  не более 100 различных физических
величин. Требуется построить в основной памяти граф связи ФЭ и
обеспечить  поиск  цепочек  ФЭ от одного до четырех звеньев по
заданным входу и выходу по возрастанию количества звеньев(12).
*/


#include <iostream>

int main() {
  std::cout << "Hello, World!" << std::endl;
  return 0;
}
