/*
Ложкин Сергей, ПС-21
Среда: CLion, C++

23. Составить программу поиска записи с включением в
сильно ветвящемся Б-дереве порядка N. Б-дерево должно
храниться и обрабатываться в файле с прямым доступом (13).
*/
#include <iostream>

#include "libs/BTree.h"

int main()
{
  BTree tree{};
  std::cout << "Hello, World!" << std::endl;
  return 0;
}
